Revit 2027 API
Railing.Reset Method
 Resets the railing to the default one that the system generates.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Reset()
Public Sub Reset
public:
void Reset()
member Reset : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  Cannot reset the railing.
See Also
Reference
Railing Class
Autodesk.Revit.DB.Architecture Namespace